emacs.d/init.org
# -*- coding: utf-8-unix; -*-

#+STARTUP: show2levels
#+STARTUP: indent

#+PROPERTY: header-args  :tangle ../tangled/init.el
#+PROPERTY: header-args+ :eval no

#+CREATED: 2024-03-13T18:19:12-03:00
#+LAST_MODIFIED: 2024-08-17T16:05:32-04:00

#+LANGUAGE: es
#+AUTHOR: Daniel Neira

#+TITLE: Literate configuration: configuración de Emacs

* Cuestiones preliminares

En esta sección cubrimos algunos elementos conceptuales mínimos para poder sacarle partido a esta guía.

** TODO Convenciones y conceptos mínimos

Interactuaremos con Emacs presionando combinaciones de teclas que involucran =Control=, =Meta= y, en algunas ocasiones, =Super=. =Meta= será, usualmente, la tecla =Alt= y =Super= será la tecla Windows en los teclados que la posean y =⌘= ("=cmd=") en el caso de los computadores Apple. Notemos que Windows interferirá con el uso fluido de la tecla =Super=, pero no habrá problema para utilizarla en otros sistemas operativos.

Podemos leer más acerca de las teclas especiales de Emacs [[http://xahlee.info/emacs/emacs/emacs_hyper_super_keys.html][aquí]].

Denotaremos =Control= con =C-=, =Meta= con =M-= y =Super= con =s-= (minúscula).

Ejemplos:

- Abrir un archivo: =C-x C-f=. Esto significa que debemos presionar la tecla =Control= y =x= a la vez y luego =Control= y =f= también a la vez.
- Cerrar un archivo: =C-x C-k=. Presionaremos =Control= y =x= y luego =Control= y =k=.

A lo largo de la guía también nos referiremos a las siguientes /distribuciones/ de Emacs:

- [[https://github.com/doomemacs/doomemacs][Doom Emacs]].
- [[https://github.com/syl20bnr/spacemacs][Spacemacs]].
- [[https://github.com/bbatsov/prelude][Prelude]].

Estos corresponden a paquetes de Emacs con configuraciones predeterminadas. Las dos primeras son populares al interior de la comunidad mientras que la tercera no lo es. Aprovechamos que su código está en GitHub para extraer algunas funciones y trucos que mejorarán nuestra experiencia de usuario en Emacs.

Otro vocabulario de utilidad:

- /buffer/: desde el punto de vista de un usuario casual, cada uno de los archivos abiertos.
- /frame/: en la GUI (interfaz gráfica de usuario), lo que usualmente llamamos "ventana".
- /window/: no corresponde a la ventana de la GUI, sino a cada una de las regiones donde Emacs está desplegando un /buffer/. Podemos desplegar varias /windows/ dentro de un /frame/.

** Comandos de utilidad válidos en una instalación limpia de Emacs.

Podemos interrumpir una secuencia de comandos presionando =C-g=.

*** Manejo de /buffers/

Es posible redefinir muchas cosas en Emacs. En particular, sus atajos de teclado. Los siguientes son algunos atajos de teclado que funcionarán en una instalación limpia de Emacs y en cualquiera en donde ellos no hayan sido redefinidos por el usuario. Entre paréntesis se incluyen las funciones que se ejecutan con cada comando.

| Acción                   | Atajo     | Función                     |
|--------------------------+-----------+-----------------------------|
| Abrir archivo            | =C-x C-f= | =find-file=                 |
| Guardar /buffer/         | =C-x C-s= | =save-buffer=               |
| Cerrar /buffer/          | =C-x k=   | =kill-buffer=               |
| Cambiar /buffer/         | =C-x b=   | =switch-to-buffer=          |
| Abrir ventana vertical   | =C-x 3=   | =split-window-right=        |
| Abrir ventana horizontal | =C-x 2=   | =split-window-below=        |
| Cambiar de ventana       | =C-x o=   | =other-window=              |
| Maximizar ventana        | =C-x 1=   | =delete-other-windows=      |
| Cerrar Emacs             | =C-x C-c= | =save-buffer-kill-terminal= |

Dado que estos atajos (y muchos de Emacs en general) no son muy ergonómicos, será usual definir unos nuevos que se ajusten mejor a cada usuario.

La tecla =CTRL= es clave en el uso Emacs. Tanto así que algunas personas llegan incluso a configurar su teclado para situarla en un lugar al que sea más fácil llegar con sus dedos. Ejemplo de esto es reemplazar a nivel lógico (mediante un programa) el funcionamiento de la tecla =Caps Lock= para que opere como si fuera =CTRL=.

*** Ejecución de expresiones de Emacs Lisp

Lisp es el nombre de una familia de lenguajes de programación con una historia que data de fines de la década de 1950. Podemos describir a Emacs como un intérprete de Emacs Lisp, el dialecto de Lisp utilizado por el programa.

Tanto Emacs Lisp como Emacs están implementados fundamentalmente en el lenguaje C. Sin embargo, no será necesario programar en C para configurarlo ni extender su funcionamiento de cara al usuario: para ello utilizaremos el propio lenguaje Emacs Lisp.

En lo que sigue, llamaremos a Emacs Lisp simplemente Lisp.

Ocasionalmente desearemos evaluar expresiones de Emacs Lisp de manera directa.

Utilizaremos =M-x= cuando queramos llamar una función de manera interactiva. Por ejemplo, =M-x flyspell-buffer= invocará a la función =flyspell-buffer=. En caso de que la función requiera argumentos, Emacs nos pedirá introducirlos para poder completar el llamado.

Si quisiéramos evaluar una expresión completa de una vez (con sus argumentos ya explicitados en caso de que ellos sean necesarios), tenemos tres alternativas (incluimos entre paréntesis las funciones de Lisp asociadas con cada combinación de teclas):

- =C-j= (=eval-print-last-sexp=): presionaremos esta combinación solo después de haber situado el cursor en el último paréntesis de cierre de la expresión que deseamos evaluar. El resultado será impreso en el mismo /buffer/ donde se encuentra la expresión evaluada.
- =C-x C-e= (=eval-last-sexp=): igual que el caso anterior, pero el resultado se imprimirá en el "área de mensajes" (/echo area/), que es algo así como la barra de estado del programa.
- =M-:= (=eval-expression=): luego de presionar esta combinación el cursor se posicionará en la /echo area/ junto al mensaje =Eval:=, esperando a que escribamos la expresión que deseamos evaluar. A diferencia de cuando presionamos =M-x=, en este caso no debemos olvidar escribir los paréntesis (esto, debido a que le estamos pidiendo a Emacs que evalúe una expresión válida de Lisp).

*** Obtención de ayuda contextual

Si tenemos dudas sobre alguna variable o función de Lisp o de algún atajo de teclado de Emacs, podemos presionar =C-h= (donde =h= denota /help/) para indicarle al programa que deseamos ayuda y luego una letra clave de acuerdo a lo explicitado en la tabla siguiente:

| Acción               | Atajo   | Función asociada    |
|----------------------+---------+---------------------|
| Ayuda sobre atajo    | =C-h k= | =describe-key=      |
| Ayuda sobre variable | =C-h v= | =describe-variable= |
| Ayuda sobre función  | =C-h f= | =describe-function= |

Completaremos la consulta escribiendo el nombre de la variable o función que nos interesa o bien presionando la combinación de teclas sobre la que deseamos obtener más información.

En caso de que iniciemos la consulta con el cursor posicionado sobre la variable o función que nos interesa, Emacs nos sugerirá completar la consulta con ese texto. Notemos que si el cursor está sobre una variable y consultamos por una función, Emacs no nos propondrá completar la consulta con ese texto. Lo mismo si el cursor está sobre una función y le indicamos que deseamos información sobre una variable.

*** Otros comandos

**** Obtener el nombre de la tipografía utilizada en el texto que se encuentra bajo el cursor

La GUI de Emacs nos permite desplegar múltiples tipografías y con distintas propiedades (como tamaño) en un mismo /buffer/, cosa imposible de lograr al ejecutar Emacs en una terminal.

Podemos aprovechar esta ventaja de la GUI para, por ejemplo, utilizar una tipografía para la prosa de un documento de Org y otra distinta para el texto que está al interior de los bloques de código contenidos en dicho documento.

Es tanta la libertad que nos da Emacs en este aspecto que podríamos olvidar ocasionalmente cuáles son las tipografías que estamos utilizando.

Si quisiéramos saber cuál es la fuente del texto que está bajo el cursor tenemos dos alternativas:

- ~C-u C-x =~: se abrirá un /buffer/ auxiliar con información contextual en donde aparecerá el dato que buscamos.
- ~M-x describe-char~: equivalente al atajo anterior, pero más memorable.

** Orden en el que son ejecutados los archivos de configuración

El [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Find-Init.html][orden]] es el siguiente:

1. =~/.emacs.el=.
2. =~/.emacs=.
3. =~/.emacs.d/init.el=.
4. =~/.config/emacs=.

En esta lista, ~init.el~ es el archivo de configuración usual de Emacs. Casi la totalidad de esta guía contiene código que será exportado a ese archivo. Pero existen otros archivos adicionales que Emacs leerá para determinar su estado de ejecución inicial.

Archivos de configuración especiales:

- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html][Early init]]: se ejecuta muy al inicio, previo a la inicialización del sistema de paquetes y de la interfaz gráfica. Todo ello ocurre antes de que Emacs comience a leer ~init.el~. Lo utilizaremos en esta guía para asegurarnos de que Emacs utilice nuestro administrador de paquetes favorito en lugar de aquel que viene incluido con el programa.
- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Easy-Customization.html][Custom]]: contendrá, si así se lo indicamos a Emacs, las instrucciones generadas por el asistente de configuración de este programa.

Existen muchos aspectos de Emacs que podemos configurar con su asistente. Preferimos en este caso no utilizarlo o bien portar a ~init.el~ el código que este genera porque trae beneficios de orden y portabilidad. Utilizamos así ~init.el~ como el archivo maestro de configuración.


* Cómo utilizar esta guía y su contenido

** Cómo exportar (/tangle/) el código almacenado en este documento Org

Exportaremos los archivos =init.el= y =early-init.el= aquí contenidos presionando la siguiente combinación: =C-c C-v t=.

** Cómo activar los archivos de configuración

Verificaremos manualmente que no existe ninguno de los siguientes archivos:

- =~/.emacs.el=.
- =~/.emacs=.
- =~/.emacs.d/init.el=.
- =~/.emacs.d/early-init.el=.

Respaldaremos aquellos archivos existentes como una medida de seguridad en caso que debamos consultarlos a futuro o restituirlos.

Almacenaremos luego los archivos =init.el= y =early-init.el= exportados con /tangle/ en el directorio =~/.emacs.d/=.

Reiniciaremos Emacs para que los cambios surtan efecto.

** Inicialización y actualización de variables

*** TODO Personales

- [ ] Quizás existan más variables interesantes que inicializar/sobreescribir

#+name: datos-usuario
#+begin_src emacs-lisp
  ;; Inicialización o actualización de variables
  ;;   - nombre de usuario
  (setq user-full-name "Daniel Neira")
  ;;   - directorio de inicio (el que aparecerá al presionar C-x C-f por primera vez)
  ;;     - debe estar ubicado en el directorio personal del usuario
  ;;       - C:\Users\{username} en Windows
  ;;       - ${HOME} en los demás sistemas operativos
  ;;     - si no existe, será creado
  (setq dn/starting-folder "org-vault")
#+end_src

*** TODO Identificación del sistema operativo anfitrión

- [ ] Hacer control de versiones para no perder las alternativas de ON-WSL que tengo aquí.

Obtenemos el tipo de sistema operativo y la versión /mayor/ de Emacs utilizando el siguiente código descontinuado adaptado de [[https://github.com/doomemacs/doomemacs/blob/29b12de83e5f8ce76e9ff38549753c69bc507650/core/core.el#L20][Doom Emacs]] y [[https://emacs.stackexchange.com/a/48584][expandido]] para incluir la posibilidad de estar trabajando en el Windows Subsystem for Linux (WSL):

#+name: obtener-OS
#+begin_src emacs-lisp
  ;; función auxiliar
  (defun dn/string-match-p (REGEXP STRING)
    " Wrapper para string-match-p que devuelve t cuando
  hay coincidencia y nil cuando no."
    (if (string-match-p REGEXP STRING)
        t
      nil))

  ;; obtención del sistema operativo que aloja Emacs
  ;; (defconst IS-WSL     (and (eq system-type 'gnu/linux)
  ;; (dn/string-match-p "Microsoft"
  ;; (shell-command-to-string "uname -a"))))
  ;; (defconst IS-LINUX   (and (not IS-WSL)
  ;; (eq system-type 'gnu/linux)))
  (defconst ON-MAC     (eq system-type 'darwin))
  (defconst ON-LINUX   (eq system-type 'gnu/linux))
  ;; asumimos que trabajamos con, al menos, Windows Vista
  (defconst ON-WINDOWS (eq system-type 'windows-nt))
  (defconst ON-WSL     (and (string-match-p "Microsoft" operating-system-release)
  			  ON-LINUX))

  ;; obtención de la versión de Emacs
  (defconst EMACS27+   (> emacs-major-version 26))
  (defconst EMACS28+   (> emacs-major-version 27))
  (defconst EMACS29+   (> emacs-major-version 28))
#+end_src

Esto nos servirá para introducir configuraciones que dependan del sistema operativo en que estemos ejecutando Emacs de manera programática.

* Configuración del administrador de paquetes

Utilizaremos =straight.el= y =use-package= en conjunto para instalar, activar y configurar paquetes.

Existe una variedad saludable de soluciones para instalar paquetes en Emacs. Podemos leer acerca de las ventajas y desventajas de cada uno de ellos en el [[https://github.com/radian-software/straight.el/tree/b3760f5829dba37e855add7323304561eb57a3d4?tab=readme-ov-file#comparison-to-other-package-managers][manual]] de =straight.el=. A pesar de que esa explicación está sesgada, no deja de ser informativa.

El único requerimiento de =straight.el= para funcionar es tener =git= instalado.

** =straight.el=

