emacs.d/init.el
;; Inicialización o actualización de variables
;;   - nombre de usuario
(setq user-full-name "Daniel Neira")
;;   - directorio de inicio (el que aparecerá al presionar C-x C-f por primera vez)
;;     - debe estar ubicado en el directorio personal del usuario
;;       - C:\Users\{username} en Windows
;;       - ${HOME} en los demás sistemas operativos
;;     - si no existe, será creado
(setq dn/starting-folder "org-vault")

;; función auxiliar
(defun dn/string-match-p (REGEXP STRING)
  " Wrapper para string-match-p que devuelve t cuando
hay coincidencia y nil cuando no."
  (if (string-match-p REGEXP STRING)
      t
    nil))

;; obtención del sistema operativo que aloja Emacs
;; (defconst IS-WSL     (and (eq system-type 'gnu/linux)
;; (dn/string-match-p "Microsoft"
;; (shell-command-to-string "uname -a"))))
;; (defconst IS-LINUX   (and (not IS-WSL)
;; (eq system-type 'gnu/linux)))
(defconst ON-MAC     (eq system-type 'darwin))
(defconst ON-LINUX   (eq system-type 'gnu/linux))
;; asumimos que trabajamos con, al menos, Windows Vista
(defconst ON-WINDOWS (eq system-type 'windows-nt))
(defconst ON-WSL     (and (string-match-p "Microsoft" operating-system-release)
			  ON-LINUX))

;; obtención de la versión de Emacs
(defconst EMACS27+   (> emacs-major-version 26))
(defconst EMACS28+   (> emacs-major-version 27))
(defconst EMACS29+   (> emacs-major-version 28))
