emacs.d/init.org
*** Instalación

Utilizamos el [[https://github.com/radian-software/straight.el/tree/b3760f5829dba37e855add7323304561eb57a3d4?tab=readme-ov-file#getting-started][código]] disponible en el manual:

#+name: straight.el-bootstrap
#+begin_src emacs-lisp
  ;;; init.el -*- coding: utf-8-unix; -*- lexical-binding: t; -*-

  ;; bootstraping straight.el de acuerdo al manual
  ;; ver GH·radian-software/straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

*** Configuración

Será una buena práctica utilizar solo un administrador de paquetes. Debemos, entonces, eliminar todo el código que se ejecute a través de =package.el=, el administrador de paquetes nativo de Emacs. De acuerdo al [[https://github.com/radian-software/straight.el/tree/b3760f5829dba37e855add7323304561eb57a3d4?tab=readme-ov-file#getting-started][manual]] de =straigth.el=, esto incluye las siguientes funciones:

- =package-initialize=
- =package-archives=

Tampoco podremos utilizar las siguientes instrucciones de configuración de =use-package=:

- =:ensure=
- =use-package-always-ensure=

Finalmente, incluiremos la siguiente expresión en el archivo "[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html][early init]]" de Emacs:

#+name: straight.el-early-init
#+begin_src emacs-lisp :tangle ../tangled/early-init.el
  (setq package-enable-at-startup nil)
#+end_src

Con esto lograremos que =package.el= no se ejecute antes de que =straight.el= pueda tomar el control.

*** Uso

**** Inspección de recetas (/recipes/)

Será algunas veces útil corroborar que el código que instalará =straight.el= proviene de la fuente que deseamos y no de una alternativa. Para obtener la /receta/ de instalación que utilizará =straight.el= [[https://systemcrafters.net/advanced-package-management/using-straight-el/][ejecutaremos]] =M-x straight-get-recipe=. La respuesta aparecerá en la "barra de estados" (/echo area/).

Si ya hubiésemos instalado el paquete y deseamos verificar la procedencia del código podemos ejecutar src_git[:tangle no]{git remote -v} en el directorio donde está el código fuente.

**** Actualización de paquetes instalados

Contamos con 3 funciones que nos permitirán actualizar paquetes:

- =M-x straight-pull-package=: nos permitirá actualizar un paquete en particular. Cuando lo ejecutemos, =straight.el= nos mostrará una lista con las alternativas que tenemos.
- =M-x straight-pull-package-and-deps=: como la función anterior, pero ahora también actualizaremos las dependencias del paquete que escojamos.
- =M-x straight-pull-all=: utilizaremos esta función cuando queramos actualizar todos lo paquetes de una vez.

**** Uso de /lockfiles/ para garantizar la reproducibilidad de los estados de los paquetes

Con =straight.el= podemos especificar los paquetes que deseamos instalar y sus "versiones". Al momento de redacción de esta guía, solo podemos especificar estas /versiones/ en función de los /commits/ del código fuente de cada paquete.

Son dos las operaciones relevantes para reproducir los estados de los paquetes:

- =M-x straight-freeze-versions=: nos permite exportar la lista de paquetes instalados y los /hash/ de los /commit/ en uso de cada uno de ellos. Nos referiremos al archivo generado por este procedimiento como /lockfile/.
- =M-x straight-thaw-versions=: se encarga de activar los /commits/ especificados en el /lockfile/ antes generado para los paquetes instalados. Asume que dichos paquetes fueron instalados con =straight.el= y que la configuración de cada uno de ellos se encuentra en ~init.el~-

Notemos que los archivos creados al ejecutar =(straight-freeze-versions)= serán guardados en =~/.emacs.d/straight/versions/=. En el caso más simple (un solo usuario de la instalación de Emacs), este directorio contendrá solo un archivo con el nombre =default.el=.

Podemos leer más acerca de la reproducibilidad de instalaciones con =straight.el= leyendo [[https://github.com/radian-software/straight.el/tree/88e574ae75344e39b436f863ef0344135c7b6517?tab=readme-ov-file#lockfile-management][su documentación]].

**** Otras opciones

Podemos consultar el artículo "[[https://systemcrafters.net/advanced-package-management/using-straight-el/][Advanced Emacs Package Management with straight.el]]" de System Crafters para conocer más acerca de las posibilidades prácticas de =straight.el=.

** =use-package=

*** Instalación

Como es de esperar, [[https://github.com/radian-software/straight.el/tree/b3760f5829dba37e855add7323304561eb57a3d4?tab=readme-ov-file#integration-with-use-package][instalamos]] =use-package= con =straight.el=.

#+name: use-package-install
#+begin_src emacs-lisp
  ;; instalación de use-package
  (straight-use-package 'use-package)
#+end_src

*** Configuración

Configuramos =use-package= para que siempre instale paquetes a través de =straight.el= asignando =t= a la variable =straight-use-package-by-default=.

Aprovechamos =use-package= para [[https://jeffkreeftmeijer.com/emacs-straight-use-package/][configurar]] esta variable:

#+name: use-package-straight.el-configuration
#+begin_src emacs-lisp
  ;; configuramos use-package para que siempre instale paquetes con straight.el
  (use-package straight
    :custom
    (straight-use-package-by-default t))
#+end_src

Con esto nos ahorramos tener que declarar =:straight t= en la configuración de cada paquete. En caso de que deseemos revertir este comportamiento, tendremos que especificar =:straight nil= en la configuración de cada paquete que no deseemos instalar con este administrador.

* Configuración de paquetes

En esta sección configuramos Emacs aprovechando paquetes desarrollados por terceras partes.

** Emacs como editor modal: emulación de Vim y paquetes relacionados

*** Evil: emulador de vim

Podemos afirmar que [[https://github.com/emacs-evil/evil][Evil]] convierte a Emacs en un editar modal fantástico. Lo configuramos de la siguiente manera:

#+name: evil-config
#+begin_src emacs-lisp
  ;; configuración de Evil
  (use-package evil
    :init
    ;; https://evil.readthedocs.io/en/latest/settings.html
    (setq evil-vsplit-window-right t
  	evil-split-window-below t
  	evil-undo-system 'undo-fu)
    ;; desactivamos C-i para que TAB funcione en la terminal
    (setq evil-want-C-i-jump nil)
    :config
    ;; definición de la tecla <leader>
    (evil-set-leader 'normal (kbd "SPC"))
    ;; guardar el archivo con w
    (evil-define-key 'normal 'global (kbd "<leader>w") 'save-buffer)
    ;; utilizar U para deshacer un cambio (notemos que U cumple otra función en Vim y aquí la estamos sobreeescribiendo)
    (evil-define-key 'normal 'global (kbd "U") 'evil-redo)
    ;; borrar desde el cursor hasta el comienzo de la línea sin modificar los registros
    (evil-define-key 'normal 'global (kbd "C-<backspace>") (kbd "\"_d0"))
    (evil-define-key 'insert 'global (kbd "C-<backspace>") (kbd "C-o \" _ d 0"))
    ;; ir al siguiente buffer
    (evil-define-key 'normal 'global (kbd "<leader>o") (kbd "C-x o"))
    ;; activar evil-mode
    (evil-mode 1))
#+end_src

Nos basamos en [[https://github.com/noctuid/evil-guide/tree/c129552001928623993d5337f6ce6469fc465e4e?tab=readme-ov-file#leader-key][Evil guide]] del usuario noctuid de GitHub para configurar la tecla =<leader>= y los atajos.

Además, hacemos uso del truco del "registro [[https://stackoverflow.com/a/3638557][hoyo negro]]" para poder configurar =C-<backspace>=.

Notemos que también podríamos haber creado ese atajo con el [[https://github.com/bbatsov/prelude/blob/dd9b01a991c9599842ba88e52fe6ae8627f4a782/core/prelude-global-keybindings.el#L82][siguiente código]] extraido de Prelude:

#+name: kill-lines-backwards
#+begin_src emacs-lisp :tangle no
  ;; Kill line backwards and adjust the indentation
  (global-set-key (kbd "C-<backspace>") (lambda ()
                                          (interactive)
                                          (kill-line 0)
                                          (indent-according-to-mode)))
#+end_src

El problema con este código es que modifica los registros, almacenando en él lo que sea que hayamos borrado. Podríamos corregirlo [[https://stackoverflow.com/a/1694997][reescribiendo los registros]] con src_emacs-lisp[:tangle no]{(setq kill-ring (cdr kill-ring))}, cosa poco elegante, pero efectiva.

*** evil-org: atajos de teclado para Org contextuales a cada modo

Utilizaremos [[https://github.com/Somelauw/evil-org-mode/][evil-org]] para activar atajos de teclado en modos distintos al de insertar. Sin él, solo podremos, por ejemplo, colapsar y expandir el contenido de las secciones con =TAB= en el modo insertar.

#+name: evil-org-config
#+begin_src emacs-lisp
  ;; configuración de evil-org
  (use-package evil-org
    :after (evil org)
    :hook (org-mode . evil-org-mode)
    :config
    (evil-org-set-key-theme '(textobjects additional return todo)))
#+end_src

Utilizamos =evil-org-set-key-theme= en el código anterior para activar los siguientes [[https://github.com/Somelauw/evil-org-mode/blob/95c6acc29ad11f4d44c3e93d6047dff256412498/evil-org.el#L60][atajos especiales]]:

- =textobjects=: [[https://github.com/Somelauw/evil-org-mode/blob/95c6acc29ad11f4d44c3e93d6047dff256412498/doc/keythemes.org#text-objects][documentación.]]
- =additional=: [[https://github.com/Somelauw/evil-org-mode/blob/95c6acc29ad11f4d44c3e93d6047dff256412498/doc/keythemes.org#additional][documentación]].
- =return=: [[https://github.com/Somelauw/evil-org-mode/blob/95c6acc29ad11f4d44c3e93d6047dff256412498/doc/keythemes.org#return][documentación]].
- =todo=: [[https://github.com/Somelauw/evil-org-mode/blob/95c6acc29ad11f4d44c3e93d6047dff256412498/doc/keythemes.org#todo][documentación]].

Durante la configuración de Evil ejecutamos src_emacs-lisp[:tangle no]{(setq evil-want-C-i-jump nil)}. Lo hicimos para eliminar el conflicto descrito en [[http://web.archive.org/web/20240314095605/https://jeffkreeftmeijer.com/emacs-evil-org-tab/]["'Fix' the tab key for visibility cycling in Org and Evil mode"]]. Notemos que este cambio rompe la compatibilidad de ese atajo con lo que esperaría un usuario de Vim.

*** evil-surround: rodear un texto con pares de caracteres

Será habitual que queramos encerrar una cadena de texto entre paréntesis (redondos, cuadrados, de llave) o entre comillas, entre otras posibilidades. Nos apoyaremos en [[https://github.com/emacs-evil/evil-surround][evil-surround]] para hacerlo con movimientos de Vim y atajos de teclado.

#+name: evil-surround-config
#+begin_src emacs-lisp
  ;; configuración de evil-surround
  (use-package evil-surround
    :config
    (global-evil-surround-mode 1))
#+end_src

Podemos ver ejemplos de uso en la [[https://github.com/emacs-evil/evil-surround/tree/da05c60b0621cf33161bb4335153f75ff5c29d91?tab=readme-ov-file#examples][documentación]] del paquete.

*** evil-exchange: intercambiar cadenas de texto de posición

Si solemos intercambiar el orden de las palabras en una oración, [[https://github.com/Dewdrops/evil-exchange][evil-exchange]] nos será de utilidad.

Aprovechamos el siguiente [[https://github.com/syl20bnr/spacemacs/blob/2254b9c16150165f459895bb49bc309b029b54e4/layers/%2Bspacemacs/spacemacs-evil/packages.el#L146][código relevante]] de Spacemacs para lograr que evil-exchange funcione correctamente.

#+name: evil-exchange-config
#+begin_src emacs-lisp
  ;; configuración de evil-exchange
  (use-package evil-exchange
    :init
    (let ((evil-exchange-key (kbd "gx"))
        (evil-exchange-cancel-key (kbd "gX")))
      (define-key evil-normal-state-map evil-exchange-key 'evil-exchange)
      (define-key evil-visual-state-map evil-exchange-key 'evil-exchange)
      (define-key evil-normal-state-map evil-exchange-cancel-key 'evil-exchange-cancel)
      (define-key evil-visual-state-map evil-exchange-cancel-key 'evil-exchange-cancel)))
#+end_src

Podemos encontrar la mejor demostración de funcionamiento de este paquete en [[http://vimcasts.org/episodes/swapping-two-regions-of-text-with-exchange-vim/][Vimcasts]]. Solo tenemos que cambiar las siguienes cosas con respecto a los ejemplos allí dados:

- Combinación clave: =cx= por =gx=.
- Cancelar una operación: =cxc= por =gX=.
- Operar sobre una línea completa: =cxx= por =gxx=.

Uso básico de este paquete:

- En modo visual:
  - Seleccionamos la primera cadena de caracteres con =v{motion}= y presionamos =gx=.
  - Seleccionamos la segunda cadena de la misma forma y presionamos =gx=.
- En modo normal:
  - Marcamos la primera cadena de caracteres con =gx{motion}=.
  - Marcamos la segunda cadena de la misma forma. Notemos que si ={motion}= es igual en ambos casos, bastará con que presionemos =.= para ejecutar el cambio.

