emacs.d/init.el

;;; init.el -*- coding: utf-8-unix; -*- lexical-binding: t; -*-

;; bootstraping straight.el de acuerdo al manual
;; ver GH·radian-software/straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; instalación de use-package
(straight-use-package 'use-package)

;; configuramos use-package para que siempre instale paquetes con straight.el
(use-package straight
  :custom
  (straight-use-package-by-default t))

;; configuración de Evil
(use-package evil
  :init
  ;; https://evil.readthedocs.io/en/latest/settings.html
  (setq evil-vsplit-window-right t
	evil-split-window-below t
	evil-undo-system 'undo-fu)
  ;; desactivamos C-i para que TAB funcione en la terminal
  (setq evil-want-C-i-jump nil)
  :config
  ;; definición de la tecla <leader>
  (evil-set-leader 'normal (kbd "SPC"))
  ;; guardar el archivo con w
  (evil-define-key 'normal 'global (kbd "<leader>w") 'save-buffer)
  ;; utilizar U para deshacer un cambio (notemos que U cumple otra función en Vim y aquí la estamos sobreeescribiendo)
  (evil-define-key 'normal 'global (kbd "U") 'evil-redo)
  ;; borrar desde el cursor hasta el comienzo de la línea sin modificar los registros
  (evil-define-key 'normal 'global (kbd "C-<backspace>") (kbd "\"_d0"))
  (evil-define-key 'insert 'global (kbd "C-<backspace>") (kbd "C-o \" _ d 0"))
  ;; ir al siguiente buffer
  (evil-define-key 'normal 'global (kbd "<leader>o") (kbd "C-x o"))
  ;; activar evil-mode
  (evil-mode 1))

;; configuración de evil-org
(use-package evil-org
  :after (evil org)
  :hook (org-mode . evil-org-mode)
  :config
  (evil-org-set-key-theme '(textobjects additional return todo)))

;; configuración de evil-surround
(use-package evil-surround
  :config
  (global-evil-surround-mode 1))

;; configuración de evil-exchange
(use-package evil-exchange
  :init
  (let ((evil-exchange-key (kbd "gx"))
      (evil-exchange-cancel-key (kbd "gX")))
    (define-key evil-normal-state-map evil-exchange-key 'evil-exchange)
    (define-key evil-visual-state-map evil-exchange-key 'evil-exchange)
    (define-key evil-normal-state-map evil-exchange-cancel-key 'evil-exchange-cancel)
    (define-key evil-visual-state-map evil-exchange-cancel-key 'evil-exchange-cancel)))
