emacs.d/init.org
*** evil-unimpaired: operaciones de conveniencia

Utilizaremos [[https://github.com/zmaas/evil-unimpaired][evil-unimpaired]] para tener acceso a la siguiente combinación de teclas en modo normal con la ventaja de que al finalizarlas seguiremos en dicho modo:

- =[<SPC>=: agregar una línea en blanco sobre la actual.
- =]<SPC>=: agregar una línea en blanco bajo la actual.

La lista de todas las combinaciones posibles se encuentra en la [[https://github.com/zmaas/evil-unimpaired/tree/2a31d10fac00488d9786e009d21d27bce7fef317?tab=readme-ov-file#default-pairs][documentación]] del paquete. Podemos, además, entender la lógica tras estas elecciones visitando la página en GitHub de [[https://github.com/tpope/vim-unimpaired/tree/6d44a6dc2ec34607c41ec78acf81657248580bf1][vim-impaired]], el paquete de Vim en el que se basa evil-unimpaired.

#+name: evil-unimpaired-config
#+begin_src emacs-lisp
  ;; configuración de evil-unimpaired
  (use-package evil-unimpaired
    :straight
    (evil-unimpaired :type git
                     :host github :repo "zmaas/evil-unimpaired")
    :config
    (evil-unimpaired-mode))
#+end_src

*** evil-terminal-cursor-changer: cambiar el aspecto del cursor en la terminal

Es probable que el cursor no nos indique en qué modo de Evil nos encontramos cuando ejecutamos Emacs en una terminal. Utilizamos [[https://github.com/7696122/evil-terminal-cursor-changer][evil-terminal-cursor-changer]] ("etcc") para corregir ese hecho.

#+name: evil-terminal-cursor-changer-config
#+begin_src emacs-lisp
  ;; configuración de evil-terminal-cursor-changer
  (unless (display-graphic-p)
    (use-package evil-terminal-cursor-changer
      :config
      (evil-terminal-cursor-changer-activate)))
#+end_src

Notemos que existirían soluciones alternativas que no requerirían la instalación de ningún paquete. Optamos, sin embargo, por usar "etcc" porque funciona correctamente.

Otras soluciones posibles:

- Configurando las variables de Evil directamente: [[https://emacs.stackexchange.com/a/7404][StackExchange]], [[https://www.reddit.com/r/emacs/comments/4rd44a/how_to_change_cursor_in_evil_mode/][Reddit]].
- Utilizando funciones auxiliares: [[https://emacs.stackexchange.com/a/14930][StackExchange]].

*** evil-owl: inspector de registros

Tratar de recordar qué información está contenida en cada uno de los registros de Evil es poco práctico. Utilizamos [[https://github.com/mamapanda/evil-owl][evil-owl]] para que nos muestre los registros disponibles y su contenido cada vez que detecta que buscamos acceder a ellos.

#+name: evil-owl-config
#+begin_src emacs-lisp
  ;; configuración de evil-owl
  (use-package evil-owl
    :config
    (setq evil-owl-max-string-length 500)
    (add-to-list 'display-buffer-alist
                 '("*evil-owl*"
                   (display-buffer-in-side-window)
                   (side . bottom)
                   (window-height . 0.3)))
    (evil-owl-mode))
#+end_src

Notemos que también es posible especificar la cantidad de líneas que debe desplegar el /buffer/ con =windows-height=. En ese caso no lo configuraremos con un número real, sino que con un [[https://www.reddit.com/r/emacs/comments/10fgwnh/comment/j4z0d6w/][número entero]].

** Interacción de Emacs con el sistema operativo anfitrión

*** TODO simpleclip: administración de portapapeles

- [ ] NOTA: no funciona en WSL. Es por ello que no lo exportamos a ~init.el~ pues estoy buscando configurar Emacs en esa plataforma. Pero sí funciona en macOS, de modo que lo correcto sería configurarlo en ese sistema operativo
- [[https://vi.stackexchange.com/questions/84/how-can-i-copy-text-to-the-system-clipboard-from-vim][SE: portapapeles en los distintos SO]].

El portapapeles del sistema operativo anfitrión y el de Emacs son distintos, pero interactúan entre ellos. La distinción entre ellos se vuelve evidente al utilizar Evil. Podemos separar los portapapeles de manera estricta para simplificar su uso con [[https://github.com/rolandwalker/simpleclip][simpleclip]].

#+name: simpleclip-config
#+begin_src emacs-lisp :tangle no
  ;; configuración de simpleclip
  (use-package simpleclip
    :after (evil)
    :config
    (simpleclip-mode 1))
#+end_src

Con Evil y simpleclip podemos ahora manejar el portapapeles de Emacs de la misma forma como lo hacemos en Vim. A la vez, podemos acceder al portapapeles del sistema operativo anfitrión de la forma habitual.

*** undo-fu: hacer y deshacer (/redo/ y /undo/) lineales

Emacs implementa las acciones de hacer y deshacer con una lógica de árboles que es poderosa, pero que no es intuitiva para la persona común. Para hacer que el programa se ajuste al funcionamiento que comparten todas las aplicaciones modernas utilizamos [[https://codeberg.org/ideasman42/emacs-undo-fu][undo-fu]].

#+name: undo-fu-config
#+begin_src emacs-lisp
  ;; configuración de undo-fu
  (use-package undo-fu
    :after (evil)
    :config
    (setq undo-fu-ignore-keyboard-quit t)
    (global-set-key (kbd "M-z")   'undo-fu-only-undo)
    (global-set-key (kbd "M-S-z") 'undo-fu-only-redo))
#+end_src

** Paquetes de conveniencia

*** yasnippet: expansión de texto

[[https://github.com/joaotavora/yasnippet][Yasnippet]] es un administrador de plantillas para Emacs. Nos permite expandir abreviaciones de acuerdo a plantillas predefinidas.

#+name: yasnippet-config
#+begin_src emacs-lisp
  ;; configuración de yasnippet
  (use-package yasnippet
    :init
    (yas-global-mode 1)
    :config
    (add-to-list #'yas-snippet-dirs (locate-user-emacs-file "snippets")))
#+end_src

Podemos apoyarnos en la [[http://joaotavora.github.io/yasnippet/snippet-development.html][documentación oficial]] para escribir nuestras plantillas, pero es más sencillo seguir [[http://web.archive.org/web/20230329004031/https://howardism.org/Technical/Emacs/templates-tutorial.html][esta guía]] de Howard Abrams.

En la práctica, debemos tener presente que las plantillas serán almacenadas en el directorio =snippets= de nuestra configuración y que debemos [[http://joaotavora.github.io/yasnippet/snippet-organization.html#org7468fa9][organizarlas en carpetas]] de acuerdo al tipo de archivo sobre el que operarán (formalmente, las organizamos de acuerdo a los modos de Emacs).

Podemos ver un ejemplo de una estructura de carpetas real visitando el [[https://github.com/AndreaCrotti/yasnippet-snippets/tree/e6ec9f1822913cea7dc67cde6aeb8f2625980950/snippets][repositorio]] no oficial de /snippets/ de Andrea Crotti. En pequeña escala, esta lucirá de la siguiente manera:

#+begin_example
~/.emacs.d/snippets/
├── emacs-lisp-mode
├── go-mode
├── latex-mode
├── org-mode
│   ├── example.yasnippet
│   └── source.yasnippet
└── python-mode
#+end_example

Iniciamos la creación de un /snippet/ con =M-x yas-new-snippet=. Se abrirá un /buffer/ con texto predeterminado donde debemos definir la plantilla. Presionaremos =C-c C-C= cuando estemos listos y seguiremos las indicaciones de Yas para guardar los cambios y cargar la plantilla.

Como referencia, Yas probablemente nos preguntará las siguientes cosas la primera vez que creemos una plantilla:

1. Choose or enter a table (yas guesses org-mode): si se trata de Org-mode, bastará con que presionemos Enter.
2. [yas] Loaded for org-mode. Also save snippet buffer? (y or n): responderemos =y=.
3. File to save snippet in: ingresaremos el nombre del archivo. Idealmente, sin espacios y con la extensión =.yasnippet= o simplemente =.yas= para llevar un orden.
4. Directory '/home/ . . .' does not exist; create? (y or n): respondemos =y=.

*** ivy: asistente de completación de texto

Podemos apoyarnos en [[https://github.com/abo-abo/swiper][Ivy]] en distintos contextos de Emacs para que nos ayude a completar la acción que queremos tomar. Por ejemplo, al comenzar a ingresar algún comando o al intentar cambiar de archivo, Ivy nos irá ofreciendo alternativas de completación que serán cada vez más precisas a medida que ingresamos más caracteres.

#+name: ivy-config
#+begin_src emacs-lisp
  ;; configuración de Ivy
  (use-package ivy
    :config
    (ivy-mode 1)
    ;;(setq ivy-use-virtual-buffers t)
    (setq ivy-count-format "(%d/%d) "))
#+end_src

Notemos que =straight.el= nos ayuda aquí a descargar el paquete correcto: el repositorio de GitHub donde está alojado =ivy.el= carece de orden y mezcla 3 paquetes relacionados, pero distintos: Ivy, Counsel y Swiper.

Podemos corroborar que la receta para instalar Ivy es la correcta y que =straight.el= no activa ninguno de los otros paquetes asociados ejecutando =M-x straight-get-recipe=.

*** which-key: asistente de completación para atajos de teclado

El número de comandos que Emacs nos ofrece a través de atajos de teclado es enorme y no será extraño que olvidemos la secuencia exacta de aquellos que no utilizamos a menudo. En estos casos podemos utilizar las sugerencias de which-key para completar aquellos atajos que no recordamos correctamente.

#+name: which-key-config
#+begin_src emacs-lisp
  ;; configuración de which-key
  (use-package which-key
    :config
    (setq echo-keystrokes 0.4)
    (which-key-mode 1))
#+end_src

Sobreescribimos el valor de =echo-keystrokes= (una variable nativa de Emacs) para que se tome 0.4 segundos de pausa antes de comenzar a darnos retroalimentación sobre los comandos que estamos introduciendo.

*** recentf: lista de los últimos archivos visitados

Nos apoyamos en =use-package= para configurar [[https://www.gnu.org/software/emacs/manual/html_node/emacs/File-Conveniences.html][recentf]], un paquete nativo de Emacs que mantiene una lista de los últimos archivos que hemos abierto.

#+name: recentf-config
#+begin_src emacs-lisp
  ;; configuración de recentf
  (use-package recentf
    :config
    (recentf-mode 1)
    (setq recentf-max-menu-items 10)
    (setq recentf-max-saved-items 15)
    :bind
    ("C-c r" . recentf-open-files))
#+end_src

Podemos leer un poco acerca del funcionamiento de recentf en [[http://xahlee.info/emacs/emacs/emacs_recentf.html][xahlee.info]].

*** company: asistente para completar instrucciones

Mientras más tiempo utilicemos Emacs, más probable es que terminemos programando, al menos ocasionalmente, en su dialecto de Lisp para configurarlo y adaptarlo a nuestras preferencias. Es razonable esperar que Emacs nos ayude a hacerlo completando las instrucciones que vamos ingresando. Esta funcionalidad está presente en el programa, pero no se activa de manera automática.

Utilizaremos [[https://company-mode.github.io/][company]] para agilizar el proceso de autocompletado. Sin paquetes adicionales, company nos ayudará cuando programemos en Emacs Lisp. Si deseáramos ayuda con otros lenguajes tendremos que instalar algún [[https://en.wikipedia.org/wiki/Language_Server_Protocol][LSP]] (/Language Server Protocol/) del lenguaje deseado y configurarlo.

#+name: company-config
#+begin_src emacs-lisp :tangle no
  ;; configuración de company
  (use-package company
    :hook ((prog-mode . company-mode)
  	 )
    :bind (:map company-active-map
  	      ("<tab>" . company-complete-selection))
    )
#+end_src

*** command-log-mode: registro de las teclas presionadas

[[https://github.com/lewang/command-log-mode][command-log-mode]] es un paquete pensado para ser utilizado durante demostraciones de Emacs. Registra en un /buffer/ auxiliar todas las teclas presionadas junto a sus funciones asociadas.

Abrimos dicho /buffer/ con =M-x clm/open-command-log-buffer=.

La documentación del paquete sugiere asociar el modo de registro de comandos a un tipo de archivo utilizando un =hook=. Lo agregaremos en la configuración a modo de ejemplo asociándolo con Org mode, pero en la práctica será mejor iniciar este modo manualmente cuando lo necesitemos.

#+name: command-log-mode-config
#+begin_src emacs-lisp :tangle no
  (use-package command-log-mode
    ;; :hook
    ;; (org-mode . command-log-mode)
    )
#+end_src

** Apariencia de Emacs

Cargaremos el código de los temas, pero no activaremos ninguno. Eso lo haremos más adelante en la configuración, luego de haber cargado todos los paquetes que deseamos utilizar.

*** Con un fondo claro

**** Leuven: estridente, pero de una forma que lo hace funcional

La apariencia de Emacs por omisión es bastante agradable, pero le faltan algunas cosas como destacar los bloques de código para poder distinguirlos a golpe de vista mientras navegamos nuestros archivos Org.

La paleta de colores de [[https://github.com/fniessen/emacs-leuven-theme][Leuven]] es estridente, pero define de manera la apariencia de múltiples elementos de la interfaz de manera única, permitiéndonos hacernos una idea mental rápida de la estructura de nuestros documentos de Org.

#+name: emacs-leuven-theme-config
#+begin_src emacs-lisp
  ;; configuración de emacs-leuven-theme
  (use-package leuven-theme
    ;; :config
    ;; (load-theme 'leuven t)
    )
#+end_src

*** Con un fondo oscuro

**** Doom-City-Lights: paleta de colores apacible

Los desarrolladores de Doom Emacs mantienen [[https://github.com/doomemacs/themes][~doom-themes~]], un repositorio de temas para su distribución que está abierto a toda la comunidad. [[https://github.com/doomemacs/themes/tree/screenshots][En este enlace]] podemos encontrar capturas de pantalla de cada uno de ellos.

En el código siguiente seleccionamos el tema ~doom-city-lights~, pero esto puede cambiarse fácilmente.

#+name: doom-themes-config
#+begin_src emacs-lisp
  (use-package doom-themes
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    ;; (load-theme 'doom-city-lights t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

  (use-package solaire-mode
    :after (doom-themes))
#+end_src

