emacs.d/init.el

;; configuración de evil-unimpaired
(use-package evil-unimpaired
  :straight
  (evil-unimpaired :type git
                   :host github :repo "zmaas/evil-unimpaired")
  :config
  (evil-unimpaired-mode))

;; configuración de evil-terminal-cursor-changer
(unless (display-graphic-p)
  (use-package evil-terminal-cursor-changer
    :config
    (evil-terminal-cursor-changer-activate)))

;; configuración de evil-owl
(use-package evil-owl
  :config
  (setq evil-owl-max-string-length 500)
  (add-to-list 'display-buffer-alist
               '("*evil-owl*"
                 (display-buffer-in-side-window)
                 (side . bottom)
                 (window-height . 0.3)))
  (evil-owl-mode))

;; configuración de undo-fu
(use-package undo-fu
  :after (evil)
  :config
  (setq undo-fu-ignore-keyboard-quit t)
  (global-set-key (kbd "M-z")   'undo-fu-only-undo)
  (global-set-key (kbd "M-S-z") 'undo-fu-only-redo))

;; configuración de yasnippet
(use-package yasnippet
  :init
  (yas-global-mode 1)
  :config
  (add-to-list #'yas-snippet-dirs (locate-user-emacs-file "snippets")))

;; configuración de Ivy
(use-package ivy
  :config
  (ivy-mode 1)
  ;;(setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) "))

;; configuración de which-key
(use-package which-key
  :config
  (setq echo-keystrokes 0.4)
  (which-key-mode 1))

;; configuración de recentf
(use-package recentf
  :config
  (recentf-mode 1)
  (setq recentf-max-menu-items 10)
  (setq recentf-max-saved-items 15)
  :bind
  ("C-c r" . recentf-open-files))

;; configuración de emacs-leuven-theme
(use-package leuven-theme
  ;; :config
  ;; (load-theme 'leuven t)
  )

(use-package doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  ;; (load-theme 'doom-city-lights t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(use-package solaire-mode
  :after (doom-themes))
