emacs.d/init.org
**** ample-theme-flat: abanico de colores limitado

El paquete ~ample-theme~ contiene 3 temas, dos de ellos con fondos claros. Seleccionamos aquí la variante ~ample-flat~, la que apenas tiene gradación entre los distintos colores de la paleta, pero podemos activar cualquiera de los 3 con facilidad.

#+name: ample-theme-flat-config
#+begin_src emacs-lisp
  (use-package ample-theme
    :init
    (load-theme 'ample t t)
    (load-theme 'ample-flat t t)
    (load-theme 'ample-light t t)
    ;; (enable-theme 'ample-flat)
    )
#+end_src

Este tema sería más útil si coloreara el fondo de los códigos incluidos en documentos Org.

*** doom-modeline: barra de estados "minimalista"

Si bien se describe como /minimalista/, la barra de estados que despliega [[https://github.com/seagle0128/doom-modeline][doom-modeline]] es informativa, además de atractiva.

#+name: doom-modeline-config
#+begin_src emacs-lisp :tangle no
  ;; configuración de doom-modeline
  ;; antes instalamos nerd-fonts, su único requerimiento
  ;;(use-package nerd-icons
    ;; :custom
    ;; The Nerd Font you want to use in GUI
    ;; "Symbols Nerd Font Mono" is the default and is recommended
    ;; but you can use any other Nerd Font if you want
    ;; (nerd-icons-font-family "Symbols Nerd Font Mono")
    ;;)
  (use-package doom-modeline
    ;;:requires (nerd-icons)
    :init
    ;;(unless (display-graphic-p)
      (setq doom-modeline-icon nil)
      ;;)
    (doom-modeline-mode 1)
    ;;:config
    ;; tiene mal desempeño en Windows
    ;;(display-battery-mode t)
    )
#+end_src

Es posible [[https://github.com/seagle0128/doom-modeline/tree/29a4bfc99962ec0d55c48ff5a503a6d722dc80a8?tab=readme-ov-file#customize][configurar muchos aspectos]] de doom-modeline. Sin embargo, como la configuración por omisión es buena, nos quedamos con dichos valores.

Consideramos activar [[https://irreal.org/blog/?p=833][=display-battery-mode=]], modo que es parte de Emacs, para desplegar el porcentaje de batería restante en la barra de estado. Lo descartamos debido a que parece introducir inestabilidades cuando Emacs corre en WSL.

Lo que no podemos pasar por alto es que será obligatorio instalar la fuente que utiliza este paquete para adornar la barra de estados si es deseamos que ella muestre íconos. En caso de que el código propuesto falle en hacerlo, podemos [[https://github.com/seagle0128/doom-modeline/tree/29a4bfc99962ec0d55c48ff5a503a6d722dc80a8?tab=readme-ov-file#faq][instalarlas manualmente]] ejecutando =M-x nerd-icons-install-fonts=.

Notemos, sin embargo, que [[https://github.com/doomemacs/doomemacs/issues/6173][no hay forma]] de hacer que los íconos se desplieguen correctamente en una terminal. Es por eso que es importante verificar antes que estamos usando la GUI de Emacs si queremos activarlos.

** Trabajo con código fuente

Podemos utilizar Emacs como un entorno de desarrollo moderno a gracias a ~treesitter~ y a los ~LSP~ (/Language Server Protocol/).

Emacs 29 y posteriores poseen soporte nativo para ~treesitter~, pero el programa debe ser compilado con esa opción. Algunas distribuciones de Linux como openSUSE Tumbleweed ofrecen Emacs con esta opción activada, pero este podría no ser el caso en otras distribuciones.

Si deseamos sacar el máximo provecho a los ~LSP~, será recomendable instalar la librería ~libjansson~ y compilar Emacs con acceso a ella. Si no lo hacemos, Emacs utilizará su propia librería para procesar los archivos JSON cuyo desempeño es comparativamente pobre.

Podemos seguir [[http://web.archive.org/web/20240405161112/https://www.masteringemacs.org/article/speed-up-emacs-libjansson-native-elisp-compilation][esta guía]] para compilar Emacs de forma básica en nuestro computador (con soporte para ~libjansson~ y para compilar código de Emacs Lisp) y [[http://web.archive.org/web/20240412172155/https://www.masteringemacs.org/article/how-to-get-started-tree-sitter][esta]] para poder trabajar además con ~treesiter~.

*** Soporte para Lua

Emacs no ofrece soporte nativo para Lua, de modo que debemos instalar un paquete para ello.

#+name: config-lua-mode
#+begin_src emacs-lisp :tangle no
  (use-package lua-mode)
#+end_src

*** TODO Configuración de tree-sitter

Configuraremos tree-sitter para soportar Lua.

#+name: config-tree-sitter
#+begin_src emacs-lisp :tangle no
  ;; configuración de tree-sitter
  (if (and (fboundp 'treesit-available-p)
  	 (treesit-available-p)
  	 (executable-find "gcc"))
      (progn
        ;; grammars to use
        (setq treesit-language-source-alist
  	    '((lua . ("https://github.com/Azganoth/tree-sitter-lua"))))
        ;; install grammars
        (unless (treesit-language-available-p 'lua)
  	(treesit-install-language-grammar 'lua))
        ;; activate installed grammars
        (setq major-mode-remap-alist
  	    '((lua-mode . lua-ts-mode)))
        ))
#+end_src

A la fecha de redacción, [[http://web.archive.org/web/20240213011810/https://robbmann.io/posts/emacs-treesit-auto/][estas]] son algunas de las definiciones de lenguaje que podemos utilizar con tree-sitter:

#+name: tree-sitter-grammars
#+begin_src emacs-lisp :tangle no
  (setq treesit-language-source-alist
        '((bash . ("https://github.com/tree-sitter/tree-sitter-bash"))
  	(c . ("https://github.com/tree-sitter/tree-sitter-c"))
  	(cmake . ("https://github.com/uyha/tree-sitter-cmake"))
  	(common-lisp . ("https://github.com/theHamsta/tree-sitter-commonlisp"))
  	(cpp . ("https://github.com/tree-sitter/tree-sitter-cpp"))
  	(css . ("https://github.com/tree-sitter/tree-sitter-css"))
  	(csharp . ("https://github.com/tree-sitter/tree-sitter-c-sharp"))
  	(elisp . ("https://github.com/Wilfred/tree-sitter-elisp"))
  	(go . ("https://github.com/tree-sitter/tree-sitter-go"))
  	(go-mod . ("https://github.com/camdencheek/tree-sitter-go-mod"))
  	(html . ("https://github.com/tree-sitter/tree-sitter-html"))
  	(js . ("https://github.com/tree-sitter/tree-sitter-javascript" "master" "src"))
  	(json . ("https://github.com/tree-sitter/tree-sitter-json"))
  	(lua . ("https://github.com/Azganoth/tree-sitter-lua"))
  	(make . ("https://github.com/alemuller/tree-sitter-make"))
  	(markdown . ("https://github.com/ikatyang/tree-sitter-markdown"))
  	(python . ("https://github.com/tree-sitter/tree-sitter-python"))
  	(r . ("https://github.com/r-lib/tree-sitter-r"))
  	(rust . ("https://github.com/tree-sitter/tree-sitter-rust"))
  	(toml . ("https://github.com/tree-sitter/tree-sitter-toml"))
  	(tsx . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src"))
  	(typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src"))
  	(yaml . ("https://github.com/ikatyang/tree-sitter-yaml"))))
#+end_src

Podemos consultar todas las definiciones alojadas en el repositorio de tree-sitter en [[https://github.com/tree-sitter-grammars][este enlace]].

** Procesamiento de textos

*** olivetti: centrado del texto en la ventana

Emacs ocupará todo el ancho de la ventana para desplegar el contenido de los /buffer/. Esto nos puede desorientar en el caso de estar trabajando con archivos de prosa como los de Org.

Podemos activar [[https://github.com/rnkn/olivetti][olivetti]] para indicarle a Emacs que deseamos que nos muestre el contenido de los archivos en una columna al centro de la ventana.

#+name: olivetti-config
#+begin_src emacs-lisp
  ;; función auxiliar
  (defun activate-olivetti-mode ()
    (olivetti-mode 1))
  ;; configuración de olivetti
  (use-package olivetti
    :init
    (setq olivetti-body-width 86)
    :hook
    (text-mode . activate-olivetti-mode))
#+end_src

Allí le indicamos a Emacs que deseamos utilizar olivetti solo en los /buffer/ de prosa, como los de Org, y no en los archivos de código fuente.

*** ws-butler: corrección de espacios en blanco

Utilizaremos [[https://github.com/hlissner/ws-butler][ws-butler]] para borrar todos los espacios en blanco inútiles que hayan sido añadidos durante la sesión activa. Esto quiere decir que ws-butler no actuará sobre los espacios en blanco que ya estuvieran presentes al abrir el archivo, lo que es una buena estrategia cuando se está trabajando con control de versiones con otras personas.

Llamaremos espacios en blanco inútiles a aquellos espacios que se encuentran, por ejemplo, al final de una línea, así como a las tabulaciones que aparecen en líneas que no contengan texto.

El código de ws-butler se ejecutará cada vez que guardemos el archivo.

La configuración siguiente está [[https://github.com/SkySkimmer/.emacs.d/blob/55404abb2a4261ad14cfc56cc67d1396e40415b1/config.org#ws-butler-unobtrusive-whitespace-remover][adaptada]] del archivo =config.org= del usuario SkySkimmer de GitHub.

#+name: ws-butler-config
#+begin_src emacs-lisp 
  ;; configuración de ws-butler
  (use-package ws-butler
    :straight
    (ws-butler :type git
               :host github :repo "lewang/ws-butler"
               :fork (:host github :repo "hlissner/ws-butler"))
    :commands
    ;; ¿será necesario activarlo si luego lo engancho con hook?
    (ws-butler-mode)
    :hook
    ((prog-mode text-mode) . ws-butler-mode))
#+end_src

Notemos que utilizaremos el /fork/ del autor de Doom Emacs debido a que anticipamos que este paquete recibirá mantenimiento en caso de que la comunidad encuentre /bugs/ en él.

Existen dos alternativas comparativamente más agresivas a ws-butler que operan sobre el archivo completo y que pueden ser ejecutadas con =M-x= en caso de necesitarlas:

- =delete-trailing-whitespace=: borra espacios al final de las líneas.
- =whitespace-cleanup=: borra multitud de espacios en blanco inútiles (ver su documentación con =C-h f=).

También podríamos configurar Emacs con el siguiente código para que ejecute ambas funciones sobre un archivo cada vez que lo guardamos:

#+name: ws-butler-aggresive-alternative
#+begin_src emacs-lisp :tangle no
  ;; alternativa agresiva a ws-butler
  (add-hook 'after-save-hook #'whitespace-cleanup)
  (add-hook 'after-save-hook #'delete-trailing-whitespace)
#+end_src

