emacs.d/init.el

(use-package ample-theme
  :init
  (load-theme 'ample t t)
  (load-theme 'ample-flat t t)
  (load-theme 'ample-light t t)
  ;; (enable-theme 'ample-flat)
  )

;; función auxiliar
(defun activate-olivetti-mode ()
  (olivetti-mode 1))
;; configuración de olivetti
(use-package olivetti
  :init
  (setq olivetti-body-width 86)
  :hook
  (text-mode . activate-olivetti-mode))

;; configuración de ws-butler
(use-package ws-butler
  :straight
  (ws-butler :type git
             :host github :repo "lewang/ws-butler"
             :fork (:host github :repo "hlissner/ws-butler"))
  :commands
  ;; ¿será necesario activarlo si luego lo engancho con hook?
  (ws-butler-mode)
  :hook
  ((prog-mode text-mode) . ws-butler-mode))
