emacs.d/init.org
*** TODO Org-mode: procesador de textos en formato Org

Notas:

- Considerar desactivar =electric-indent-mode= como en mi configuración original (parece que ya está solucionado pues no puedo replicar [[https://www.philnewton.net/blog/electric-indent-with-org-mode/][esto]]).
- Funciones especiales en los títulos y listas: [[https://orgmode.org/manual/Headlines.html][link]].
- Speed keys: [[https://orgmode.org/manual/Speed-Keys.html][link]].
- Código para desactivar la confirmación de Org babel: [[https://emacs.stackexchange.com/a/21128][link]].
- Shortcuts para trabajar con imágenes:
  - =C-c C-x C-v <-- mostrar/ocultar imágenes=
  - =C-c C-x M-v <-- volver a cargar todas las imágenes=
- Considerar eliminar la posibilidad de ejecutar código en Org (para R está RStudio y para Python está Jupyter)
- Cronómetros (Org base)
  - [[https://orgmode.org/manual/Clocking-commands.html][Clocking commands]] (documentación de Org mode)
  - [[https://writequit.org/denver-emacs/presentations/2017-04-11-time-clocking-with-org.html][Clocking time with Org-mode]] (muy bueno)

**** redactar

- Qué tiempo se despliega en la modeline: org-clock-mode-line-total (notemos que esta variable solo aparece después de activar el reloj por primera vez)
  - 'current: mostrar solo el tiempo actual
  - 'today: el tiempo de todo el día (problemas a la medianoche)
  - 'repeat: con respecto a la última vez que se trabajó en esta cosa repetitiva
  - 'all: todo el tiempo
  - 'auto: all o repeat, este último para tareas repetitivas
- Para recorrer las posibilidades en un ciclo: [[https://mbork.pl/2019-05-11_Toggling_modeline_clock_display][link]]
- Comandos:
  - ~C-c C-x C-i~: comenzar
  - ~C-c C-x C-o~: terminar
  - ~C-c C-x C-q~: cancelar
  - ~C-c C-x C-d~: reporte rápido
- Sobre cronómetros que no se pierden al cerrar Emacs: [[https://writequit.org/denver-emacs/presentations/2017-04-11-time-clocking-with-org.html][link]] y [[https://emacsdocs.org/docs/org/Clocking-Work-Time][link]]
- Sobre tabs y espacios para indentar: [[https://dougie.io/emacs/indentation/][link]]

**** Funciones auxiliares

***** Cambiar el valor de una propiedad (campo) de un documento Org

#+name: org-change-property-value
#+begin_src emacs-lisp
  ;; - actualizar propiedad de documento Org
  (defun dn/update-org-property (property-regex property-new-value)
    " Replaces first match of property-regex value with property-new-value.
  It only works in Org-mode."
    (when (eq major-mode 'org-mode)
      (save-excursion
        (widen)
        (goto-char (point-min))
        (when (re-search-forward property-regex (point-max) t)
          (progn
            ;;(kill-line) guardaría la timestamp en el kill-ring
  	  ;;(delete-region a b) no lo hace
  	  ;; https://stackoverflow.com/a/21780995
  	  ;; alt: https://unix.stackexchange.com/a/136581
  	  (delete-region (point) (line-end-position))
            (insert (concat " " property-new-value))
            )))))
#+end_src

***** Actualizar el campo =LAST_MODIFIED= de los documentos Org

#+name: org-update-property-last-modified
#+begin_src emacs-lisp
  (defun dn/update-org-last-modified ()
    " Updates the value of LAST_MODIFIED with current timestamp."
    (interactive)
    ;; desactivamos undo de manera momentánea
    ;; fuente: https://emacs.stackexchange.com/a/4222
    (let (buffer-undo-list)
      (dn/update-org-property "^#\\+LAST_MODIFIED:"
  			    (format-time-string "%Y-%m-%dT%H:%M:%S%:z"))))
#+end_src

***** Eliminar enlace de Org conservando su descripción

#+name: org-delete-link-keep-description
#+begin_src emacs-lisp
  ;; borrar enlace de documento Org
  ;; fuente: https://emacs.stackexchange.com/a/10714
  (defun afs/org-replace-link-by-link-description ()
    "Replace an Org link by its description or, if empty, its address."
    (interactive)
    (if (org-in-regexp org-link-bracket-re 1)
        (save-excursion
          (let ((remove (list (match-beginning 0) (match-end 0)))
                (description
                 (if (match-end 2)
                     (org-match-string-no-properties 2)
                   (org-match-string-no-properties 1))))
            (apply 'delete-region remove)
            (insert description)))))
#+end_src

**** Configuración de Org

#+name: org-mode-config
#+begin_src emacs-lisp
  ;; configuración de Org-mode
  (use-package org
    :defer t
    :config
    ;; go back to old (pre-Org 9.4) org-return behaviour (see Org 9.4 release notes)
    ;;(add-hook 'org-mode-hook 'deactivate-electric-indent-local-mode)
    ;; Org initial visibility: global settings
    ;;   local +STARTUP alternatives:
    ;;     'overview', 'content', 'showall', 'show2levels', . . ., 'show5levels', 'showeverything'
    (setq org-startup-folded 'content)
    ;; Org indent mode: global settings
    ;;   local +STARTUP alternatives: 'indent' and 'noindent'
    ;;   note that +STARTUP 'indent' leaves 'hidestars' redundant and has precedence over 'showstars'
    (setq org-startup-indented t)
    ;; always leave an empty line between collapsed headers
    (setq org-cycle-separator-lines 1)
    ;; activate speed commands on headers
    ;; also: special shortcuts on headers and lists
    ;; (note that all these work in Insert "mode" only)
    (setq org-use-speed-commands t
  	org-special-ctrl-a/e t
  	org-special-ctrl-k t
  	org-ctrl-k-protect-subtree 'error)
    ;; use a curved arrow instead of 3 dots to signal an invisible region
    (setq org-ellipsis " ⤵")
    ;; don't underline the org-ellipsis character(s)
    (set-face-attribute 'org-ellipsis nil :underline nil)
    ;; deal with edits on invisible regions in a smart way
    (setq org-catch-invisible-edits 'show-and-error)
    ;; never hide the emphasis markers (for example, slashes for italics)
    (setq org-hide-emphasis-markers nil)
    ;; how to display LaTeX images (math)
    ;; C-c C-x C-l (org-latex-preview) <-- show/hide equation next to point
    ;; C-u C-c C-x C-l <-- show/hide equations in current section
    ;; C-u C-u C-c C-x C-l <-- show/hide equations in the current document
    (setq org-format-latex-options (plist-put org-format-latex-options :scale 1.8)
  	org-format-latex-options (plist-put org-format-latex-options :foreground "Black")
  	org-format-latex-options (plist-put org-format-latex-options :background "White")
  	org-format-latex-options (plist-put org-format-latex-options :html-foreground "Black")
  	org-format-latex-options (plist-put org-format-latex-options :html-background "Transparent")
  	org-format-latex-options (plist-put org-format-latex-options :html-scale 1.0))
    ;; bypass org-babel confirmation when evaluating the listed languages
    (defun ryuslash/org-confirm-babel-evaluate (lang body)
      (not (member lang '("R"))))
    (setq org-confirm-babel-evaluate #'ryuslash/org-confirm-babel-evaluate)
    ;; tell org-babel which languages it should be aware of
    ;; nil para desactivar, t para activar
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((R . nil)
       (emacs-lisp . t)))
    ;;  :bind
    ;;  (:map org-mode-map
    ;;        ("C-a" . org-beginning-of-line)
    ;;        ("C-e" . org-end-of-line)
    ;;        ("C-k" . org-kill-line))
    ;;(put 'org-mode 'flyspell-mode-predicate 'org-mode-flyspell-verify)
    ;; reloj de Org mode
    (evil-define-key 'normal 'global (kbd "<leader>ci") 'org-clock-in)
    (evil-define-key 'normal 'global (kbd "<leader>co") 'org-clock-out)
    (evil-define-key 'normal 'global (kbd "<leader>cl") 'org-clock-in-last)
    (evil-define-key 'normal 'global (kbd "<leader>cs") 'org-clock-display)
    :hook
    ;;(org-mode . flyspell-mode)
    (before-save . dn/update-org-last-modified))
#+end_src

* Configuración base de Emacs

En esta sección configuramos Emacs a través de las funcionalidades que este provee de forma nativa.

** Relacionadas con el funcionamiento de Emacs

*** Desactivar el mensaje de bienvenida de Emacs

Al hacer esto, Emacs se iniciará desplegando el /buffer/ ~*scratch*~ en lugar del mensaje de bienvenida.

#+name: bypass-startup-message
#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
#+end_src

