emacs.d/init.org
*** Forzar el uso de UTF-8 y de LF para denotar saltos de línea

Existen distintas versiones sobre cómo configurar Emacs para que trabaje con UTF-8 de manera consistente. Una bien austera es la que [[https://github.com/doomemacs/doomemacs/blob/286be1b2496a3ffa2280a16a41f56babebea93f0/lisp/doom-start.el#L133][proponían]] los autores de Doom Emacs:

#+name: doom-emacs-utf8-lf-config
#+begin_src emacs-lisp
  ;;; Encodings
  ;; Contrary to what many Emacs users have in their configs, you don't need more
  ;; than this to make UTF-8 the default coding system:
  (set-language-environment 'utf-8)
  ;; ...but `set-language-environment' also sets `default-input-method', which is
  ;; a step too opinionated.
  ;; (setq default-input-method nil)
  ;; ...And the clipboard on Windows could be in a wider encoding (UTF-16), so
  ;; leave Emacs to its own devices there.
  ;;(eval-when! (not doom--system-windows-p)
  ;;  (setq selection-coding-system 'utf-8))
  (setq selection-coding-system 'utf-8)
#+end_src

En este caso no asignamos ~nil~ a ~default-input-method~, cosa que hasta el momento no ha provocado efectos adversos visibles. La otra diferencia con lo propuesto por los autores de Doom Emacs es que ejecutamos la asignación a ~selection-coding-system~ sin verificar acaso estamos trabajando en un sistema distinto a Windows.

Otro detalle de codificación que puede traernos problemas si planeamos utilizar Emacs de forma nativa tanto en Linux como en Windows es qué carácter utilizar para representar los saltos de línea en los archivos de texto.

Hablando gruesamente, existen dos alternativas para indicarle al computador la existencia de saltos de línea en un archivo de texto: la secuencia CR+LF y la LF.

La primera de ellas es utilizada en la actualidad por Windows. La segunda, de manera simplificada, por todos los sistemas operativos derivados de UNIX, lo que incluye GNU/Linux y macOS.

Daremos preferencia a la secuencia utilizada por Linux y la imponemos con el [[https://emacs.stackexchange.com/a/75782][siguiente código]]:

#+name: stack-overflow-utf8-lf-config
#+begin_src emacs-lisp
  ;; Emacs en Windows puede comportarse distinto en cuanto a los saltos de línea
  ;; buscamos que prefiera utf8 con LF de unix
  ;; https://emacs.stackexchange.com/a/75782
  (prefer-coding-system 'utf-8-unix)
  ;;(setq coding-system-for-read 'utf-8-unix)
  ;;(setq coding-system-for-write 'utf-8-unix)
#+end_src

Complementamos lo anterior con [[http://xahlee.info/emacs/emacs/emacs_file_encoding.html][estas últimas recomendaciones]]:

#+name: xahlee-utf-8-lf-config
#+begin_src emacs-lisp
  ;; http://xahlee.info/emacs/emacs/emacs_file_encoding.html
  ;; http://xahlee.info/emacs/emacs/emacs_encoding_decoding_faq.html
  ;;(set-language-environment 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-keyboard-coding-system 'utf-8-unix)
  ;; add this especially on Windows, else python might show output problems
  (set-terminal-coding-system 'utf-8-unix)
#+end_src

Podemos leer más acerca de la codificación de archivos de texto plano [[http://xahlee.info/emacs/emacs/emacs_encoding_decoding_faq.html][aquí]]. Si planeamos trabajar solo en entornos Unix, es probable que baste nada más con incluir el código que aparece al comienzo de esta sección en nuestro ~init.el~.

Independiente de la configuración anterior, le podemos indicar a Emacs que nuestros archivos Org utilizan la codificación UTF-8 de UNIX colocando la siguiente instrucción al comienzo de ellos:

#+name: files-utf8-encoding
#+begin_src emacs-lisp :tangle no
  ;; -*- coding: utf-8-unix; -*-
#+end_src

*** Desactivar los mecanismos de protección contra la pérdida de información

Emacs trata de minimizar la posibilidad de que perdamos información utilizando distintos métodos. Los más llamativos son los que crean archivos de respaldo con caracteres /gato/ (=#=) y /cola de chancho/ (=~=) en el directorio de trabajo. Esto puede ser molesto pues /ensucia/ nuestros directorios de trabajo con archivos temporales que en ocasiones tendremos que borrar manualmente.

Podemos lidiar con esta molestia forzando a que Emacs almacene estos archivos temporales en un directorio distinto al de trabajo o bien desactivando estos mecanismos de protección. Un buen argumento a favor de lo segundo es evitar posibles fugas de información delicada, cosa que podría ocurrir si no se presta atención a la configuración de estos mecanismos.

Desactivamos las medidas de protección con el siguiente [[https://github.com/hlissner/doom-emacs/blob/b6fe731153f48d77cd78914dc67a72bcdcbb090a/core/core-editor.el#L81][código descontinuado]] de Doom Emacs:

#+name: forbid-autosave-and-others
#+begin_src emacs-lisp
  ;; desactivar el guardado automático de archivos
  ;; quienes no acostumbren guardar su trabajo periódicamente preferirán
  ;; no cambiar el valor de esta variable
  (setq auto-save-default nil)

  ;; desactivar la protección contra colisiones
  ;; estos son los archivos con los caracteres ".#" en su nombre
  (setq create-lockfiles nil)

  ;; desactivar la creación de archivos de respaldo
  ;; estos son los archivos con caracter "~" al final de su nombre
  (setq make-backup-files nil)
#+end_src

Notemos que la [[https://github.com/doomemacs/doomemacs/blob/a6df88a56a3fccf483ee992dc4801f5d9a1983c4/lisp/doom-editor.el#L110][recomendación a la fecha de redacción]] de los mantenedores de Doom Emacs es desactivar los =lockfiles= y los =backup-files= y configurar =auto-save=.

*** Fijar el directorio de inicio por omisión

El siguiente código nos permite definir el directorio en donde se iniciará el "explorador de archivos" de Emacs:

#+name: config-starting-folder
#+begin_src emacs-lisp
  ;; configurar el directorio de inicio
  ;;   función auxiliar para subir en la jerarquía de directorios
  (defun cb/parent-directory (dir)
    " Ruta al directorio padre de `dir'.
  Fuente: https://stackoverflow.com/a/14096693"
    (unless (equal "/" dir)
      (file-name-directory (directory-file-name dir))))
  ;;   asignación de `dn/my-home' dependiendo del sistema operativo anfitrión
  (if ON-WINDOWS
      (setq dn/my-home (cb/parent-directory (cb/parent-directory (getenv "HOME"))))
    (setq dn/my-home (file-name-as-directory (getenv "HOME"))))
  ;;   asignación del directorio de inicio (si no existe, lo creamos)
  (let ((temp-dir (expand-file-name
  		 (file-name-as-directory dn/starting-folder)
  		 (file-name-as-directory dn/my-home))))
    (unless (file-directory-p temp-dir)
      (make-directory temp-dir))
    (setq default-directory temp-dir))
#+end_src

Especificaremos el directorio de nuestro /home/ donde queremos comenzar con la variable =dn/starting-folder=.

*** Configurar el archivo creado con el asistente de configuración

Podemos configurar Emacs de manera /programática/ o asistida. Cuando ocupamos esta segunda opción, Emacs [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Saving-Customizations.html][almacenará por omisión]] las instrucciones en el archivo =init.el=.

Utilizamos el [[https://old.reddit.com/r/emacs/comments/9rrhy8/emacsers_with_beautiful_initel_files_what_about/e8j58jb/][código siguiente]] para indicarle a Emacs que utilice el archivo =custom.el= para almacenar dichas configuraciones:

#+name: custom-config-file
#+begin_src emacs-lisp
  ;; fijamos el archivo secundario de configuraciones y, si existe, lo cargamos
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file))
#+end_src

Hacemos esto como medida preventiva: en caso de utilizar el asistente de configuración, las instrucciones que este cree no contaminarán nuestro archivo ~init.el~.

*** Desactivar la campana

Desactivamos el sonido de la campana y el eventual destello de la ventana asociado con esta notificación con el [[https://github.com/doomemacs/doomemacs/blob/286be1b2496a3ffa2280a16a41f56babebea93f0/lisp/doom-ui.el#L150][siguiente código]]:

#+name: deactivate-bell
#+begin_src emacs-lisp
  ;; desactivar la campana
  (setq ring-bell-function #'ignore
        visible-bell nil)
#+end_src

** Experiencia de usuario

*** Activar el ajuste de línea

Activamos este recurso solo en los archivos de texto.

#+name: text-files-word-wrap
#+begin_src emacs-lisp
  ;; activar el ajuste de línea en buffers de texto
  (add-hook 'text-mode-hook #'turn-on-visual-line-mode)
#+end_src

*** Desactivar el centrado de la pantalla cuando el cursor atraviesa los límites del /buffer/

Nos apoyamos en el código que [[https://github.com/doomemacs/doomemacs/blob/c94ea8e4b1e3b2bfd3911ca4f95a110e0964cad7/core/core-ui.el#L181][utilizaban]] los autores de Doom Emacs hace un tiempo (el código [[https://github.com/doomemacs/doomemacs/blob/a6df88a56a3fccf483ee992dc4801f5d9a1983c4/lisp/doom-ui.el#L162][actual]] a la fecha de redacción no es muy distinto):

#+name: deactivate-autoscroll
#+begin_src emacs-lisp
  ;; desactivar el centrado automático de la pantalla
  (setq hscroll-margin 2
        hscroll-step 1
        ;; Emacs spends too much effort recentering the screen if you scroll the
        ;; cursor more than N lines past window edges (where N is the settings of
        ;; `scroll-conservatively'). This is especially slow in larger files
        ;; during large-scale scrolling commands. If kept over 100, the window is
        ;; never automatically recentered. The default (0) triggers this too
        ;; aggressively. Setting it to 10 will trigger recenter if scrolling too far
        ;; off-screen.
        scroll-conservatively 10
        scroll-margin 0
        scroll-preserve-screen-position t
        ;; Reduce cursor lag by a tiny bit by not auto-adjusting `window-vscroll'
        ;; for tall lines.
        auto-window-vscroll nil
        ;; mouse
        mouse-wheel-scroll-amount '(5 ((shift) . 2))
        mouse-wheel-progressive-speed nil)  ; don't accelerate scrolling
#+end_src

*** Recordar el historial de estados de las ventanas

Existen algunos comandos muy útiles de Emacs (como los de ayuda) que al ser invocados abrirán ventanas al interior del /frame/ para mostrar información.

Recuperar la disposición previa de las ventanas podría tomarnos unas cuantas combinaciones de teclas que dependerán del contexto.

Podemos utilizar =winner-mode= para simplificar la administración de los distintos estados de las ventanas al interior del /frame/.

Al activar este modo podremos navegar entre el historial de estados utilizando siempre la misma combinación de teclas, sin importar el contexto. Esto se traduce en que siempre podremos deshacer y rehacer un cambio (movernos en el historial de estados) con =C-c ←= y =C-c →=.

#+name: winner-mode-config
#+begin_src emacs-lisp
  ;; activar winner-mode
  (winner-mode 1)
#+end_src

*** Cortar texto solo cuando esté seleccionado de manera visible

Cuando uno utiliza Emacs sin la emulación de edición modal que nos provee Evil, debe presionar =C-w= para cortar texto. Esto operará, por omisión, cortando el texto que se encuentre entre la posición actual del cursor y la última /marca/ que hayamos registrado (podemos leer qué es una marca en el contexto de Emacs consultando [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Mark.html][el manual]]).

Este comportamiento confundirá a más de algún usuario. Podemos configurar Emacs para que, al presionar =C-w=, solo corte el texto que esté seleccionado de manera visible en la pantalla con el siguiente [[https://www.reddit.com/r/emacs/comments/amm03u/comment/efncv2x/][código]]:

#+name: kill-highlighted-regions-only
#+begin_src emacs-lisp
  ;; don't kill a region with C-w unless it is highlighted
  (defun nerfed-kill ()
    (interactive)
    (if (use-region-p)
        (kill-region (region-begin) (region-end))))
  (global-set-key (kbd "C-w") 'nerfed-kill)
#+end_src

