emacs.d/init.el
;; Contrary to what many Emacs users have in their configs, you don't need more
;; than this to make UTF-8 the default coding system:
(set-language-environment 'utf-8)
;; ...but `set-language-environment' also sets `default-input-method', which is
;; a step too opinionated.
;; (setq default-input-method nil)
;; ...And the clipboard on Windows could be in a wider encoding (UTF-16), so
;; leave Emacs to its own devices there.
;;(eval-when! (not doom--system-windows-p)
;;  (setq selection-coding-system 'utf-8))
(setq selection-coding-system 'utf-8)

;; Emacs en Windows puede comportarse distinto en cuanto a los saltos de línea
;; buscamos que prefiera utf8 con LF de unix
;; https://emacs.stackexchange.com/a/75782
(prefer-coding-system 'utf-8-unix)
;;(setq coding-system-for-read 'utf-8-unix)
;;(setq coding-system-for-write 'utf-8-unix)

;; http://xahlee.info/emacs/emacs/emacs_file_encoding.html
;; http://xahlee.info/emacs/emacs/emacs_encoding_decoding_faq.html
;;(set-language-environment 'utf-8)
(set-default-coding-systems 'utf-8)
(set-keyboard-coding-system 'utf-8-unix)
;; add this especially on Windows, else python might show output problems
(set-terminal-coding-system 'utf-8-unix)

;; desactivar el guardado automático de archivos
;; quienes no acostumbren guardar su trabajo periódicamente preferirán
;; no cambiar el valor de esta variable
(setq auto-save-default nil)

;; desactivar la protección contra colisiones
;; estos son los archivos con los caracteres ".#" en su nombre
(setq create-lockfiles nil)

;; desactivar la creación de archivos de respaldo
;; estos son los archivos con caracter "~" al final de su nombre
(setq make-backup-files nil)

;; configurar el directorio de inicio
;;   función auxiliar para subir en la jerarquía de directorios
(defun cb/parent-directory (dir)
  " Ruta al directorio padre de `dir'.
Fuente: https://stackoverflow.com/a/14096693"
  (unless (equal "/" dir)
    (file-name-directory (directory-file-name dir))))
;;   asignación de `dn/my-home' dependiendo del sistema operativo anfitrión
(if ON-WINDOWS
    (setq dn/my-home (cb/parent-directory (cb/parent-directory (getenv "HOME"))))
  (setq dn/my-home (file-name-as-directory (getenv "HOME"))))
;;   asignación del directorio de inicio (si no existe, lo creamos)
(let ((temp-dir (expand-file-name
		 (file-name-as-directory dn/starting-folder)
		 (file-name-as-directory dn/my-home))))
  (unless (file-directory-p temp-dir)
    (make-directory temp-dir))
  (setq default-directory temp-dir))

;; fijamos el archivo secundario de configuraciones y, si existe, lo cargamos
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))

;; desactivar la campana
(setq ring-bell-function #'ignore
      visible-bell nil)

;; activar el ajuste de línea en buffers de texto
(add-hook 'text-mode-hook #'turn-on-visual-line-mode)

;; desactivar el centrado automático de la pantalla
(setq hscroll-margin 2
      hscroll-step 1
      ;; Emacs spends too much effort recentering the screen if you scroll the
      ;; cursor more than N lines past window edges (where N is the settings of
      ;; `scroll-conservatively'). This is especially slow in larger files
      ;; during large-scale scrolling commands. If kept over 100, the window is
      ;; never automatically recentered. The default (0) triggers this too
      ;; aggressively. Setting it to 10 will trigger recenter if scrolling too far
      ;; off-screen.
      scroll-conservatively 10
      scroll-margin 0
      scroll-preserve-screen-position t
      ;; Reduce cursor lag by a tiny bit by not auto-adjusting `window-vscroll'
      ;; for tall lines.
      auto-window-vscroll nil
      ;; mouse
      mouse-wheel-scroll-amount '(5 ((shift) . 2))
      mouse-wheel-progressive-speed nil)  ; don't accelerate scrolling

;; activar winner-mode
(winner-mode 1)

;; don't kill a region with C-w unless it is highlighted
(defun nerfed-kill ()
  (interactive)
  (if (use-region-p)
      (kill-region (region-begin) (region-end))))
(global-set-key (kbd "C-w") 'nerfed-kill)
