emacs.d/init.org
*** Comportamiento de la tecla =ALT= en macOS

Emacs interpreta las dos teclas =ALT= como /meta/ en macOS. Esto es un problema para quienes dependemos de =ALT= para introducir caracteres que no existen en el idioma inglés.

Podemos "liberar" la tecla =ALT= derecha en macOS para que no sea interpretada como /meta/ con el siguiente código:

#+name: unbind-right-alt-key
#+begin_src emacs-lisp
  ;; unbind right-ALT from Emacs
  (when ON-MAC
    (setq ns-right-alternate-modifier 'none))
#+end_src

*** Ocultar la barra de herramientas de la GUI

Como la barra de herramientas de la GUI no presta ninguna utilidad, podemos ocultarla.

#+name: hide-tool-bar
#+begin_src emacs-lisp
  ;; ocultar la barra de herramientas de la GUI
  (tool-bar-mode -1)
#+end_src

*** Aumentar o disminuir el tamaño de las letras ("/zoom/")

Inspirados en [[https://github.com/bbatsov/prelude/blob/7b1270848353c95e79079447d790fabb6da71210/core/prelude-global-keybindings.el#L36][este código]], podemos asignar atajos de teclado a las funciones de aumento (~text-scale-increase~) y reducción (~text-scale-decrease~) del tamaño de letra en el /buffer/ actual de la siguiente forma:

#+begin_src emacs-lisp
  ;; zoom in/out text with the keyboard
  (if ON-MAC
      (progn
        (global-set-key (kbd "s-+") 'text-scale-increase)
        (global-set-key (kbd "s--") 'text-scale-decrease))
    (global-set-key (kbd "C-+") 'text-scale-increase)
    (global-set-key (kbd "C--") 'text-scale-decrease))
#+end_src

Diferenciamos entre macOS y otros sistemas operativos para mantener la consistencia en cada uno de ellos: en macOS, lo habitual es que las funciones de /zoom in/ y /out/ estén asociadas a la tecla =cmd= (=s= en el código), mientras que los demás sistemas operativos suelen utilizar la tecla =CTRL= para el mismo fin.

*** Activación del tema de acuerdo a si accedemos a Emacs a través de su GUI o no

Cargamos ~Leuven~ cuando iniciamos Emacs con su GUI y ~doom-city-lights~ cuando lo hacemos en la terminal.

#+name: activate-theme-config
#+begin_src emacs-lisp
  ;; (defun dn/load-theme-cond ()
  ;;   "Carga un tema claro u oscuro dependiendo de si estamos ejecutando
  ;; Emacs con la GUI o en una terminal."
  (if (display-graphic-p)
      (load-theme 'leuven t)
    (progn
      (load-theme 'doom-city-lights t)
      (solaire-global-mode +1)))

  ;; (add-hook 'after-make-frame-functions #'dn/load-theme-cond)
#+end_src

*** TODO Ajustar la fuente a utilizar en el editor

La GUI de Emacs nos da la libertad de utilizar múltiples tipografías en un mismo /buffer/, cuestión imposible cuando ejecutamos el programa en la terminal. Esto último se debe a que todos los programas que se ejecutan en una terminal solo pueden utilizar una tipografía, que es la configurada en ella.

Presentamos a continuación dos configuraciones: una en la que iniciamos una nueva instancia de Emacs cada vez que iniciamos la aplicación y otra para cuando ejecutamos Emacs en modo cliente y servidor a través de un ~daemon~, de modo que todos los clientes que utilicemos se conectarán y dependerán de un /servidor/.

Dado que, a la fecha de redacción, el ~daemon~ de Emacs bajo la WSLg de Windows 10 parece adolecer de algunos /bugs/ y que, en la práctica, solo estaremos trabajando con una instancia de Emacs de forma local, activaremos solo la primera configuración en nuestro ~init.el~.

Notemos, además, que es necesario configurar las fuentes en ~init.el~ y no en ~early-init.el~. Lo segundo podría aparecer como una alternativa ideal cuando ejecutamos Emacs en modo ~daemon~: como existen algunas limitaciones prácticas al trabajar con el ~daemon~ de Emacs que dejan la configuración de la primera ventana de la GUI que abramos algo huérfana, almacenar nuestra configuración de tipografías en ~early-init.el~ asoma como una buena solución. El problema es que ese archivo se ejecuta antes de cargar los componentes de la GUI, estado en el que Emacs se comporta como si estuviera siendo ejecutado en una terminal, de modo que no tendremos acceso a las tipografías del sistema y nuestra configuración de tipografías no tendrá efecto.

Finalmente, debemos también considerar la posibilidad de que nuestras fuentes preferidas no estén presentes en el sistema anfitrión, en cuyo caso no debemos configurar nada.

**** TODO Al utilizar una instancia de Emacs por cada cliente

- [ ] Explorar acaso este es el código que disminuye el rendimiento de Emacs con el paso del tiempo (el profiler daba cuenta de que font-lock-fontify-region, derivado de jit-lock-function, estaba gastando muchos recursos)
- [ ] Verificar acaso las cosas se arreglan evitando que Emacs comprima las fuentes en memoria (una de las soluciones recomendadas por la gente)
- [ ] Investigar [[https://www.reddit.com/r/emacs/comments/1azrmul/help_with_emacs_performance_fontlockmode/][estas]] recomendaciones y comentarios (verificar que no estamos ejecutando ningún paquete de Doom) y [[https://www.reddit.com/r/emacs/comments/1bwe92d/incredibly_slow_when_navigating_through_file/][este]] otro hilo de Reddit con información comlementaria
- [ ] Probar esta configuración en una distribución diferente a openSUSE
- [ ] Considerar la posibilidad de que este sea un problema del kernel de WSL, el que al momento de la redacción tiene problemas de estabilidad entre hibernaciones de Windows
- [ ] Funciones alternativas: [[https://emacs.stackexchange.com/a/3044][link]]

La estrategia es la siguiente:

- Verificar que el sistema anfitrión cuenta con alguna de las fuentes que deseamos:
  - ~dn/org-text-fonts~: fuentes para el texto.
  - ~dn/org-block-fonts~: fuentes para toda la interfaz de Emacs y los bloques de Org.
- Configuramos la primera fuente de la ~alist~ ~dn/available-org-block-fonts~ como aquella predeterminada para toda la interfaz de Emacs.
- Luego asignamos el primer elemento de ~dn/available-org-text-fonts~ a todos los modos de texto. Como consecuencia de esto, todos los bloques de Org adoptarán esa misma fuente.
- Nos aseguramos de que los bloques de Org utilicen ~dn/available-org-block-fonts~ volviendo a configurarla.

#+name: configurar-fuente
#+begin_src emacs-lisp
  ;; configurar las fuentes
  ;; configuramos una fuente para todo Emacs y luego configuramos los buffers
  ;; de texto de manera particular

  ;; enfoques:
  ;;   https://www.reddit.com/r/emacs/comments/111bsc9/comment/j8eukes/
  ;;   https://emacs.stackexchange.com/a/3044
  ;;   https://zzamboni.org/post/beautifying-org-mode-in-emacs/

  (defvar dn/org-text-fonts '(("JetBrains Mono" . 12)  ;; multiplataforma
  			    ("Roboto Mono" . 12) ;; multiplataforma
  			    ("Menlo" . 18)  ;; exclusiva de macOS
  			    ("Consolas" . 16)  ;; exclusiva de Windows
  			    ("DejaVu Sans Mono" . 12))  ;; usualmente disponible en Linux
    "Tipografías deseadas y su tamaño en puntos en orden de preferencia.")

  (defvar dn/org-block-fonts '(("Iosevka Fixed" . 13)  ;; multiplataforma
    			     ("Fira Code" . 12))  ;; multiplataforma
    "Tipografías monoespaciadas deseadas y su tamaño en puntos en orden de preferencia.")

  (defun font-available-p (font-name)
    ;; fuente:
    ;;   https://emacsredux.com/blog/2021/12/22/check-if-a-font-is-available-with-emacs-lisp/
    (find-font (font-spec :name font-name)))

  (defun dn/check-available-fonts (font-alist)
    "Verifica qué fuentes están disponibles en la plataforma anfitriona.
    Devuelve aquellas existentes en orden de preferencia."
    (let (available-fonts)
      (dolist (font font-alist)
        (when (font-available-p (car font))
          (push font available-fonts)))
      (nreverse available-fonts)))

  (setq dn/available-org-text-fonts (dn/check-available-fonts dn/org-text-fonts))
  (setq dn/available-org-block-fonts (dn/check-available-fonts dn/org-block-fonts))

  (unless (eq dn/available-org-block-fonts nil)

    ;; (setq my-org-block-font-spec (format "%s-%d"
    ;; (caar dn/available-org-block-fonts)
    ;; (cdar dn/available-org-block-fonts)))

    (set-face-attribute 'default nil
  		      :family (caar dn/available-org-block-fonts)
  		      :height (* 10 (cdar dn/available-org-block-fonts)))
    )


  ;; (setq my-org-text-font-spec (format "%s-%d"
  ;; (caar dn/available-org-text-fonts)
  ;; (cdar dn/available-org-text-fonts)))

  (defun dn/set-org-faces ()
    "Configurar la tipografía para Org."
    (with-eval-after-load 'org-faces
      (unless (eq dn/available-org-text-fonts nil)
        (face-remap-add-relative 'default
  			       :family (caar dn/available-org-text-fonts)
  			       :height (* 10 (cdar dn/available-org-text-fonts))))
      (unless (eq dn/available-org-block-fonts nil)
        (set-face-attribute 'org-block nil
  			  :family (caar dn/available-org-block-fonts)
  			  :height (* 10 (cdar dn/available-org-block-fonts))))
      ))

  (add-hook 'text-mode-hook #'dn/set-org-faces)
#+end_src

**** Al utilizar una instancia de Emacs para todos los clientes: modo ~daemon~

Podemos configurar la fuente que Emacs utilizará independiente de si es invocado desde el menú de aplicaciones o desde la línea de comandos en modo de /daemon/ adaptando un [[http://web.archive.org/web/20201011234137/https://gist.github.com/weirdNox/80ac2707b776d18d5517adaaa1dda901][código]] compartido por el usuario [[http://web.archive.org/web/20201011233955/https://old.reddit.com/r/emacs/comments/8fyzjd/theme_not_loading_completly_with_emacsserver/dy8cd0a/][iNox]] de Reddit:

#+name: font-config
#+begin_src emacs-lisp :tangle no
  ;; set font: working solution for emacsclient and emacs instances
  (defvar nox/fonts '(("Menlo" . 18)  ;; macOS
                      ("Consolas" . 16)  ;; Windows
                      ("DejaVu Sans Mono" . 12)  ;; Linux
                      ("Roboto Mono" . 12)) ;; otro
    "List of fonts and sizes. The first one available will be used.")

  (defun nox/change-font ()
    (interactive)
    (let* (available-fonts font-name font-size font-setting)
      (dolist (font nox/fonts (setq available-fonts (nreverse available-fonts)))
        (when (member (car font) (font-family-list))
          (push font available-fonts)))
                                          ; if: si no se encontró la fuente requerida
      (if (not available-fonts)
          (error "No fonts from the chosen set are available")
                                          ; else: sí se encontró la fuente
                                          ;   nested if: si la llamada fue interactiva
        (if (called-interactively-p 'interactive)
            (let* ((chosen (assoc-string (completing-read "What font to use? " available-fonts nil t) available-fonts)))
              (setq font-name (car chosen)
                    font-size (read-number "Font size: " (cdr chosen))))
                                          ;    nested else: llamada no interactiva; guardar nombre/tamaño de fuente por separado
          (setq font-name (caar available-fonts)
                font-size (cdar available-fonts)))
                                          ; armar el string nombre-tamaño (por ejemplo, "Menlo-16")
        (setq font-setting (format "%s-%d" font-name font-size))
                                          ; configurar la fuente
        (set-frame-font font-setting nil t)
        (add-to-list 'default-frame-alist (cons 'font font-setting)))))

  (defun nox/setup-font (frame)
    (with-selected-frame frame
      (remove-hook 'after-make-frame-functions 'nox/setup-font)
      (nox/change-font)))

  ;; original
  ;;(if (daemonp)
  ;;    (add-hook 'after-make-frame-functions 'nox/setup-font)
  ;;  (nox/setup-font (car (frame-list))))
  ;; nuevo, pero falta corregirlo:
  ;; -> uno podría ejecutar Emacs en un terminal conectada
  ;; al daemon (en cuyo caso, if daemonp == TRUE se caerá porque
  ;; terminal no tiene las fuentes de las funciones NOX
  (if (daemonp)
      (add-hook 'after-make-frame-functions 'nox/setup-font)
    (if (display-graphic-p)
        (nox/setup-font (car (frame-list)))))
#+end_src

Notemos que, en sistemas donde las variedades de una misma fuente (normal, itálica y negrita como las fundamentales) estén almacenadas en archivos distintos, este código solo será capaz de configurar las variantes normal y negrita cuando estemos trabajando con la GUI de WSL 2 (Windows Subsystem for Linux).

* TODO Otras configuraciones

