emacs.d/init.el

;; unbind right-ALT from Emacs
(when ON-MAC
  (setq ns-right-alternate-modifier 'none))

;; ocultar la barra de herramientas de la GUI
(tool-bar-mode -1)

;; zoom in/out text with the keyboard
(if ON-MAC
    (progn
      (global-set-key (kbd "s-+") 'text-scale-increase)
      (global-set-key (kbd "s--") 'text-scale-decrease))
  (global-set-key (kbd "C-+") 'text-scale-increase)
  (global-set-key (kbd "C--") 'text-scale-decrease))

;; (defun dn/load-theme-cond ()
;;   "Carga un tema claro u oscuro dependiendo de si estamos ejecutando
;; Emacs con la GUI o en una terminal."
(if (display-graphic-p)
    (load-theme 'leuven t)
  (progn
    (load-theme 'doom-city-lights t)
    (solaire-global-mode +1)))

;; (add-hook 'after-make-frame-functions #'dn/load-theme-cond)

;; configurar las fuentes
;; configuramos una fuente para todo Emacs y luego configuramos los buffers
;; de texto de manera particular

;; enfoques:
;;   https://www.reddit.com/r/emacs/comments/111bsc9/comment/j8eukes/
;;   https://emacs.stackexchange.com/a/3044
;;   https://zzamboni.org/post/beautifying-org-mode-in-emacs/

(defvar dn/org-text-fonts '(("JetBrains Mono" . 12)  ;; multiplataforma
			    ("Roboto Mono" . 12) ;; multiplataforma
			    ("Menlo" . 18)  ;; exclusiva de macOS
			    ("Consolas" . 16)  ;; exclusiva de Windows
			    ("DejaVu Sans Mono" . 12))  ;; usualmente disponible en Linux
  "Tipografías deseadas y su tamaño en puntos en orden de preferencia.")

(defvar dn/org-block-fonts '(("Iosevka Fixed" . 13)  ;; multiplataforma
  			     ("Fira Code" . 12))  ;; multiplataforma
  "Tipografías monoespaciadas deseadas y su tamaño en puntos en orden de preferencia.")

(defun font-available-p (font-name)
  ;; fuente:
  ;;   https://emacsredux.com/blog/2021/12/22/check-if-a-font-is-available-with-emacs-lisp/
  (find-font (font-spec :name font-name)))

(defun dn/check-available-fonts (font-alist)
  "Verifica qué fuentes están disponibles en la plataforma anfitriona.
  Devuelve aquellas existentes en orden de preferencia."
  (let (available-fonts)
    (dolist (font font-alist)
      (when (font-available-p (car font))
        (push font available-fonts)))
    (nreverse available-fonts)))

(setq dn/available-org-text-fonts (dn/check-available-fonts dn/org-text-fonts))
(setq dn/available-org-block-fonts (dn/check-available-fonts dn/org-block-fonts))

(unless (eq dn/available-org-block-fonts nil)

  ;; (setq my-org-block-font-spec (format "%s-%d"
  ;; (caar dn/available-org-block-fonts)
  ;; (cdar dn/available-org-block-fonts)))

  (set-face-attribute 'default nil
		      :family (caar dn/available-org-block-fonts)
		      :height (* 10 (cdar dn/available-org-block-fonts)))
  )


;; (setq my-org-text-font-spec (format "%s-%d"
;; (caar dn/available-org-text-fonts)
;; (cdar dn/available-org-text-fonts)))

(defun dn/set-org-faces ()
  "Configurar la tipografía para Org."
  (with-eval-after-load 'org-faces
    (unless (eq dn/available-org-text-fonts nil)
      (face-remap-add-relative 'default
			       :family (caar dn/available-org-text-fonts)
			       :height (* 10 (cdar dn/available-org-text-fonts))))
    (unless (eq dn/available-org-block-fonts nil)
      (set-face-attribute 'org-block nil
			  :family (caar dn/available-org-block-fonts)
			  :height (* 10 (cdar dn/available-org-block-fonts))))
    ))

(add-hook 'text-mode-hook #'dn/set-org-faces)
