emacs.d/init.org
** Insertar fecha y hora actual

Insertamos la fecha y hora actual según la ISO 8601 con T como separador y sin especificar microsegundos en el lugar donde se encuentra el cursor con la siguiente función:

#+name: current-date-time-iso8601
#+begin_src emacs-lisp
  ;; función para insertar timestamp actual
  (defun dn/current-timestamp ()
    " Inserta la fecha y hora actual en formato ISO 8601 con T como
  separador y sin especificar microsegundos. "
    (interactive)
    (insert (format-time-string "%Y-%m-%dT%H:%M:%S%:z")))
#+end_src

