emacs.d/init.el

;; función para insertar timestamp actual
(defun dn/current-timestamp ()
  " Inserta la fecha y hora actual en formato ISO 8601 con T como
separador y sin especificar microsegundos. "
  (interactive)
  (insert (format-time-string "%Y-%m-%dT%H:%M:%S%:z")))
